target/classes/servicioWebDinardap.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="InteroperadorlImplService" targetNamespace="http://servicio.interoperadorws.interoperacion.dinardap.gob.ec/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://servicio.interoperadorws.interoperacion.dinardap.gob.ec/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:types>
<xs:schema attributeFormDefault="unqualified" elementFormDefault="unqualified" targetNamespace="http://servicio.interoperadorws.interoperacion.dinardap.gob.ec/" xmlns:tns="http://servicio.interoperadorws.interoperacion.dinardap.gob.ec/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
<xs:complexType name="getFichaGeneral">
<xs:sequence>
<xs:element minOccurs="0" name="codigoPaquete" type="xs:string"/>
<xs:element minOccurs="0" name="numeroIdentificacion" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="getFichaGeneralResponse">
<xs:sequence>
<xs:element minOccurs="0" name="return" type="tns:fichaGeneral"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="fichaGeneral">
<xs:sequence>
<xs:element minOccurs="0" name="codigoPaquete" type="xs:string"/>
<xs:element maxOccurs="unbounded" minOccurs="0" name="instituciones" nillable="true" type="tns:institucion"/>
<xs:element minOccurs="0" name="mensaje" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="institucion">
<xs:sequence>
<xs:element minOccurs="0" name="datosPrincipales" type="tns:datosPrincipales"/>
<xs:element minOccurs="0" name="detalle" type="tns:detalle"/>
<xs:element minOccurs="0" name="mensaje" type="xs:string"/>
<xs:element minOccurs="0" name="nombre" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="datosPrincipales">
<xs:sequence>
<xs:element maxOccurs="unbounded" minOccurs="0" name="registros" nillable="true" type="tns:registro"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="registro">
<xs:sequence>
<xs:element minOccurs="0" name="campo" type="xs:string"/>
<xs:element minOccurs="0" name="codigo" type="xs:string"/>
<xs:element minOccurs="0" name="valor" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="detalle">
<xs:sequence>
<xs:element maxOccurs="unbounded" minOccurs="0" name="items" nillable="true" type="tns:item"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="item">
<xs:sequence>
<xs:element minOccurs="0" name="nombre" type="xs:string"/>
<xs:element maxOccurs="unbounded" minOccurs="0" name="registros" nillable="true" type="tns:registro"/>
</xs:sequence>
</xs:complexType>
<xs:element name="getFichaGeneral" nillable="true" type="tns:getFichaGeneral"/>
<xs:element name="getFichaGeneralResponse" nillable="true" type="tns:getFichaGeneralResponse"/>
</xs:schema>
  </wsdl:types>
  <wsdl:message name="getFichaGeneralResponse">
    <wsdl:part element="tns:getFichaGeneralResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getFichaGeneral">
    <wsdl:part element="tns:getFichaGeneral" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="InteroperadorlImpl">
    <wsdl:operation name="getFichaGeneral">
      <wsdl:input message="tns:getFichaGeneral" name="getFichaGeneral">
    </wsdl:input>
      <wsdl:output message="tns:getFichaGeneralResponse" name="getFichaGeneralResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="InteroperadorlImplServiceSoapBinding" type="tns:InteroperadorlImpl">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getFichaGeneral">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="getFichaGeneral">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getFichaGeneralResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="InteroperadorlImplService">
    <wsdl:port binding="tns:InteroperadorlImplServiceSoapBinding" name="InteroperadorlImplPort">
      <soap:address location="http://interoperabilidad.dinardap.gob.ec:7979/interoperador"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>